Тестовая_база_ERP_14/src/InformationRegisters/РЭЙ_СрокиПредставленияПаспортаСделки/РЭЙ_СрокиПредставленияПаспортаСделки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РЭЙ_СрокиПредставленияПаспортаСделки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Дни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаСтартаТаймера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Процедура</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/InformationRegisters/РЭЙ_СрокиПредставленияПаспортаСделки/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Представление "Дни"
	ТекстДни = "ВЫБОР";
	Для т = 1 По РЭЙ_СлужебныйСервер.ПолучитьСоответствиеПредставлениеДни().Количество() Цикл
		ТекстДни = ТекстДни + "
		|КОГДА Дни = " + т + "
		|	ТОГДА """ + РЭЙ_СлужебныйСервер.ПредставлениеДни(т) + """";
	КонецЦикла;
	ТекстДни = ТекстДни + "
	|ИНАЧЕ """"
	|КОНЕЦ КАК ПредставлениеДни";
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "ВЫРАЗИТЬ("""" КАК СТРОКА(50)) КАК ПредставлениеДни", ТекстДни);
	
	//Представление "Дата старта таймера"
	ТекстДатаСтартаТаймера = "ВЫБОР";
	Для т = 1 По РЭЙ_СлужебныйСервер.ПолучитьСоответствиеПредставлениеДатаСтартаТаймера().Количество() Цикл
		ТекстДатаСтартаТаймера = ТекстДатаСтартаТаймера + "
		|КОГДА ДатаСтартаТаймера = " + т + "
		|	ТОГДА """ + РЭЙ_СлужебныйСервер.ПредставлениеДатаСтартаТаймера(т) + """";
	КонецЦикла;
	ТекстДатаСтартаТаймера = ТекстДатаСтартаТаймера + "
	|ИНАЧЕ """"
	|КОНЕЦ КАК ПредставлениеДатаСтартаТаймера";
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "ВЫРАЗИТЬ("""" КАК СТРОКА(50)) КАК ПредставлениеДатаСтартаТаймера", ТекстДатаСтартаТаймера);
КонецПроцедуры


&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	ПоказатьПредупреждение(, "Из этой формы запрещено добавлять настройки сроков представления документов валютного контроля
				|Форма настройки сроков находится в меню ""Настройка - Сроки представления документов валютного контроля""!", 60);
				
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	ПоказатьПредупреждение(, "Из этой формы запрещено изменять настройку сроков представления документов валютного контроля
				|Форма настройки сроков находится в меню ""Настройка - Сроки представления документов валютного контроля""!", 60);
				
	Отказ = Истина;
КонецПроцедуры
